### Biodiversidad en los parques
Este tutorial te guiará a través de los conceptos esenciales sobre cómo indexar y filtrar datos con Pandas. Piensa en él como una versión muy condensada y con un enfoque específico de [the official indexing documentation.](http://pandas.pydata.org/pandas-docs/stable/indexing.html#).

Empezamos cargando Pandas y los datos:

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('parks.csv', index_col=['Park Code'])

In [4]:
filtered_parks = df[df['Acres'] > 1000000]
print(filtered_parks)

                                                Park Name       State  \
Park Code
DENA                    Denali National Park and Preserve          AK
DEVA                           Death Valley National Park      CA, NV
EVER                             Everglades National Park          FL
GAAR       Gates Of The Arctic National Park and Preserve          AK
GLAC                                Glacier National Park          MT
GLBA               Glacier Bay National Park and Preserve          AK
GRCA                           Grand Canyon National Park          AZ
KATM                    Katmai National Park and Preserve          AK
KOVA                           Kobuk Valley National Park          AK
LACL                Lake Clark National Park and Preserve          AK
WRST       Wrangell - St Elias National Park and Preserve          AK
YELL                            Yellowstone National Park  WY, MT, ID

             Acres  Latitude  Longitude
Park Code
DENA       3372402     63.33    -150.50
DEVA       4740912     36.24    -116.82
EVER       1508538     25.32     -80.93
GAAR       7523898     67.78    -153.30
GLAC       1013572     48.80    -114.00
GLBA       3224840     58.50    -137.00
GRCA       1217403     36.06    -112.14
KATM       3674530     58.50    -155.00
KOVA       1750717     67.55    -159.28
LACL       2619733     60.97    -153.42
WRST       8323148     61.00    -142.00
YELL       2219791     44.60    -110.50

In [5]:
df.head()

                        Park Name State   Acres  Latitude  Longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50
BIBE       Big Bend National Park    TX  801163     29.25    -103.25
BISC       Biscayne National Park    FL  172924     25.65     -80.08

### Indexing: Single Rows
La forma más sencilla de acceder a una fila es pasar el número de fila al método ".iloc". Ten en cuenta que la primera fila es cero, al igual que los índices de las listas.

In [6]:
df.iloc[2]

Park Name    Badlands National Park
State                            SD
Acres                        242756
Latitude                      43.75
Longitude                    -102.5
Name: BADL, dtype: object

El otro enfoque principal es pasar un valor del índice de tu DataFrame al método ".loc":

In [7]:
df.loc['BADL']

Park Name    Badlands National Park
State                            SD
Acres                        242756
Latitude                      43.75
Longitude                    -102.5
Name: BADL, dtype: object

### Indexing: Multiple Rows
Si necesitamos múltiples filas, podemos pasar varios valores de índice. ¡Ten en cuenta que esto cambia el orden de los resultados!

In [8]:
df.loc[['BADL', 'ARCH', 'ACAD']]

                        Park Name State   Acres  Latitude  Longitude
Park Code
BADL       Badlands National Park    SD  242756     43.75    -102.50
ARCH         Arches National Park    UT   76519     38.68    -109.57
ACAD         Acadia National Park    ME   47390     44.35     -68.21

In [9]:
df.iloc[[2, 1, 0]]

                        Park Name State   Acres  Latitude  Longitude
Park Code
BADL       Badlands National Park    SD  242756     43.75    -102.50
ARCH         Arches National Park    UT   76519     38.68    -109.57
ACAD         Acadia National Park    ME   47390     44.35     -68.21

Cortar (slicing) el DataFrame como si fuera una lista también funciona.

In [10]:
df[:3]

                        Park Name State   Acres  Latitude  Longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

In [11]:
df[3:6]

,Park Name,State,Acres,Latitude,Longitude
Park Code,,,,,
BIBE,Big Bend National Park,TX,801163,29.25,-103.25
BISC,Biscayne National Park,FL,172924,25.65,-80.08
BLCA,Black Canyon of the Gunnison National Park,CO,32950,38.57,-107.72

### Indexing: Columns
Podemos acceder a un subconjunto de las columnas en un DataFrame colocando la lista de columnas entre corchetes de la siguiente manera:

In [12]:
df['State'].head(5)

Park Code
ACAD    ME
ARCH    UT
BADL    SD
BIBE    TX
BISC    FL
Name: State, dtype: object

También puedes acceder a una sola columna como si fuera un atributo del DataFrame, pero solo si el nombre no tiene espacios, utiliza solo caracteres básicos y no comparte un nombre con un método del DataFrame. Así que, "df.State" funciona.

In [13]:
df.State.head(3)

Park Code
ACAD    ME
ARCH    UT
BADL    SD
Name: State, dtype: object

Pero "df.Park Code" fallará ya que hay un espacio en el nombre.

In [14]:
df.Park Code

SyntaxError: invalid syntax (1629693805.py, line 1)

Solo podemos acceder a la columna "Park Code" pasando su nombre como una cadena entre corchetes, como "df['Park Code']". Recomiendo usar siempre ese enfoque o convertir siempre los nombres de las columnas a un formato válido tan pronto como leas los datos para que no tengas que mezclar los dos métodos. Es solo un poco más ordenado.

Es una buena práctica limpiar los nombres de las columnas para evitar este tipo de errores. Usaré una función de limpieza muy simple aquí, ya que los nombres no tienen caracteres extraños. Por convención, los nombres también deben ser convertidos a minúsculas. Pandas es sensible a mayúsculas y minúsculas, por lo que las llamadas futuras a todas las columnas deberán ser actualizadas.

In [15]:
df.columns = [col.replace(' ', '_').lower() for col in df.columns]
print(df.columns)

Index(['park_name', 'state', 'acres', 'latitude', 'longitude'], dtype='object')

### Indexing: Columns and Rows
Si necesitamos hacer un subconjunto tanto por columnas como por filas, puedes apilar los comandos que ya hemos aprendido.

In [53]:
# Selecciona las columnas 'state' y 'acres' del DataFrame df. Luego, toma las primeras tres filas de ese subconjunto de columnas.
df[['state', 'acres']][:3]

          state   acres
Park Code
ACAD         ME   47390
ARCH         UT   76519
BADL         SD  242756

In [15]:
df[['state', 'acres']].iloc[[0, 2, 4]] # Selecciona las filas con los índices 0, 2 y 4, y las columnas 'state' y 'acres'.

          state   acres
Park Code
ACAD         ME   47390
BADL         SD  242756
BISC         FL  172924

In [16]:
df[['state', 'acres']][2:5] # Selecciona las filas desde el índice 2 hasta el 4 (el valor final no se incluye).

          state   acres
Park Code
BADL         SD  242756
BIBE         TX  801163
BISC         FL  172924

In [57]:
df[df['acres'] > 5e6][['state', 'acres']] # Filtra las filas donde la columna 'acres' es mayor a 5.000.000 
                                          # 5e6 (notación científica) y luego selecciona las columnas 'state' y 'acres'.

          state    acres
Park Code
GAAR         AK  7523898
WRST         AK  8323148

In [31]:
df.iloc[1:4, df.columns.get_loc('state')]  # Selecciona las filas de las posiciones 1 a 3 (excluyendo la 4) y 
                                           # la columna 'state' usando la posición de la columna obtenida con get_loc.

Park Code
ARCH    UT
BADL    SD
BIBE    TX
Name: state, dtype: object

In [33]:
# Selecciona las filas con los índices 'ACAD', 'ARCH' y 'BADL', y las columnas 'state' y 'acres'.
df.loc[['ACAD', 'ARCH', 'BADL'],['state', 'acres']]

          state   acres
Park Code
ACAD         ME   47390
ARCH         UT   76519
BADL         SD  242756

In [35]:
print(df.index)

Index(['ACAD', 'ARCH', 'BADL', 'BIBE', 'BISC', 'BLCA', 'BRCA', 'CANY', 'CARE',
       'CAVE', 'CHIS', 'CONG', 'CRLA', 'CUVA', 'DENA', 'DEVA', 'DRTO', 'EVER',
       'GAAR', 'GLAC', 'GLBA', 'GRBA', 'GRCA', 'GRSA', 'GRSM', 'GRTE', 'GUMO',
       'HALE', 'HAVO', 'HOSP', 'ISRO', 'JOTR', 'KATM', 'KEFJ', 'KOVA', 'LACL',
       'LAVO', 'MACA', 'MEVE', 'MORA', 'NOCA', 'OLYM', 'PEFO', 'PINN', 'REDW',
       'ROMO', 'SAGU', 'SEKI', 'SHEN', 'THRO', 'VOYA', 'WICA', 'WRST', 'YELL',
       'YOSE', 'ZION'],
      dtype='object', name='Park Code')

### Indexing: Scalar Values
Como habrás notado, todo lo que hemos probado hasta ahora devuelve un pequeño DataFrame o una serie. Si necesitas un solo valor, simplemente pasa un solo valor de columna e índice.

In [46]:
# Accede al valor de la columna 'state' en la fila de la posición 2 (recuerda que los índices son cero-basados).
df.state.iloc[1]

'TX'

Ten en cuenta que obtendrás un tipo de retorno diferente si pasas un solo valor dentro de una lista.

In [44]:
# Accede al valor de la columna 'state' en la fila de la posición 2, pero devuelve una Serie en lugar de un valor único 
# porque el índice está dentro de una lista.
df.state.iloc[[3,4,5]]

Park Code
BIBE    TX
BISC    FL
BLCA    CO
Name: state, dtype: object

### Selecting a Subset of the Data

El método principal para hacer subconjuntos de datos en Pandas se llama [indexación booleana](http://pandas.pydata.org/pandas-docs/stable/indexing.html#boolean-indexing). Primero, echemos un vistazo a lo que hace Pandas cuando le pedimos que evalúe un valor booleano:

In [48]:
# Compara cada valor de la columna 'state' con 'UT', devolviendo una serie de valores booleanos, 
# luego muestra las primeras 3 filas con .head(3).
(df.state == 'UT').head(3)

Park Code
ACAD    False
ARCH     True
BADL    False
Name: state, dtype: bool

Obtenemos una serie con los resultados del valor booleano. Al pasar esa serie a un DataFrame, obtenemos el subconjunto del DataFrame donde el valor booleano evalúa como `True`.

In [50]:
# Filtra el DataFrame 'df' para seleccionar solo las filas donde el valor de la columna 'state' es igual a 'UT'.
df[df.state == 'UT']

                            park_name state   acres  latitude  longitude
Park Code
ARCH             Arches National Park    UT   76519     38.68    -109.57
BRCA       Bryce Canyon National Park    UT   35835     37.57    -112.18
CANY        Canyonlands National Park    UT  337598     38.20    -109.93
CARE       Capitol Reef National Park    UT  241904     38.20    -111.17
ZION               Zion National Park    UT  146598     37.30    -113.05

Algunos de los operadores lógicos son diferentes:
- `~` reemplaza a `not`
- `|` reemplaza a `or`
- `&` reemplaza a `and`

Si tienes varios argumentos, deberán estar envueltos entre paréntesis. Por ejemplo:

In [52]:
# Filtra el DataFrame 'df' seleccionando las filas donde la latitud es mayor a 60 o 
# el número de acres es mayor a un millón, y luego muestra las primeras 3 filas del resultado.
df[(df.latitude > 60) | (df.acres > 10**6)].head(3)

,park_name,state,acres,latitude,longitude
Park Code,,,,,
DENA,Denali National Park and Preserve,AK,3372402,63.33,-150.50
DEVA,Death Valley National Park,"CA, NV",4740912,36.24,-116.82
EVER,Everglades National Park,FL,1508538,25.32,-80.93

También puedes usar expresiones más complicadas, incluyendo lambdas.

In [17]:
# Filtra el DataFrame 'df' seleccionando las filas donde el nombre del parque 
# ('park_name') se divide en 3 palabras, y luego muestra las primeras 3 filas del resultado.
df[df['park_name'].str.split().apply(lambda x: len(x) == 3)].head(3)

                        park_name state   acres  latitude  longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

El comentario explica lo siguiente:

- `df['park_name'].str.split()`: Divide cada valor de la columna 'park_name' en palabras, utilizando el espacio como separador. Esto devuelve una lista de palabras para cada nombre de parque.
- `.apply(lambda x: len(x) == 3)`: Aplica una función lambda que evalúa si la longitud de la lista (el número de palabras) es igual a 3. Devuelve True para las filas cuyo nombre de parque contiene exactamente tres palabras y False en caso contrario.
- `df[...]`: Usa la serie booleana resultante para filtrar el DataFrame df y seleccionar solo las filas donde el nombre del parque contiene tres palabras.
- `.head(3)`: Muestra las primeras tres filas del subconjunto filtrado.

### La expresión `lambda x: len(x) == 3` tiene tres partes principales:

1. **`lambda`**:
   - Es una palabra clave en Python que se utiliza para crear funciones anónimas, es decir, funciones sin nombre. Estas funciones son muy útiles cuando necesitas una función simple y corta, como en este caso.
   
2. **`x`**:
   - Es el parámetro de entrada de la función `lambda`. En este caso, `x` representa cada elemento de la lista de palabras que resulta de dividir el valor de `'park_name'`. Es decir, cada `x` es una lista de palabras (por ejemplo, `['Yellowstone', 'National', 'Park']`).

3. **`len(x) == 3`**:
   - Esta es la expresión que evalúa la función `lambda`. Para cada elemento `x` (que es una lista de palabras), se calcula la longitud con `len(x)`. Si la longitud de la lista es igual a 3, la expresión devuelve `True`, de lo contrario devuelve `False`.

### Resumen de la expresión:

- `lambda x: len(x) == 3`: Crea una función anónima que toma un parámetro `x` (en este caso, una lista de palabras) y devuelve `True` si la longitud de esa lista es 3, o `False` si no lo es.

### Aplicación en el código:

- **`df['park_name'].str.split()`**: Divide cada nombre de parque en palabras.
- **`.apply(lambda x: len(x) == 3)`**: Aplica la función `lambda` a cada lista de palabras obtenida, verificando si el nombre del parque tiene exactamente tres palabras.

In [60]:
def check_three_words(x):
    return len(x) == 3

df[df['park_name'].str.split().apply(check_three_words)].head(3)

                        park_name state   acres  latitude  longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

### Key Companion Methods: `isin` and `isnull`
Estos métodos facilitan y aceleran mucho la realización de algunas tareas muy comunes. Supongamos que queremos encontrar todos los parques de la costa oeste. `isin` hace que eso sea simple:

In [61]:
# Filtra el DataFrame 'df' seleccionando las filas donde el valor de la columna 'state' es 'WA', 'OR' o 'CA', 
# y muestra las primeras 5 filas del resultado.
df[df.state.isin(['WA', 'OR', 'CA'])].head()

                               park_name state   acres  latitude  longitude
Park Code
CHIS       Channel Islands National Park    CA  249561     34.01    -119.42
CRLA           Crater Lake National Park    OR  183224     42.94    -122.10
JOTR           Joshua Tree National Park    CA  789745     33.79    -115.90
LAVO       Lassen Volcanic National Park    CA  106372     40.49    -121.51
MORA         Mount Rainier National Park    WA  235625     46.85    -121.75

### Less Common Methods
Pandas ofrece muchos más métodos de indexación. Probablemente deberías ceñirte a algunos de ellos para mantener tu código legible, pero vale la pena saber que existen en caso de que necesites leer el código de otras personas o tengas un caso de uso inusual:

- Hay otras formas de dividir los datos con corchetes. Por razones de legibilidad, por favor, no uses ninguno de ellos.
- `.at` y `.iat`: como `.loc` y `.iloc`, pero mucho más rápidos a cambio de solo funcionar con una sola columna y devolver un solo resultado.
- `.eval`: evaluación rápida de un conjunto limitado de operadores simples. `.query` funciona llamando a esto.
- `.ix`: método obsoleto que intentaba determinar si un índice debía evaluarse con `.loc` o `.iloc`. ¡Esto llevó a muchos errores sutiles! Si ves esto, estás viendo un código antiguo que ya no funcionará.
- `.get`: como `.loc`, pero devolverá un valor predeterminado si la clave no existe en el índice. Solo funciona en una sola columna/serie.
- `.lookup`: No recomendado. Está en la documentación, pero no está claro si esto aún se admite.
- `.mask`: como la indexación booleana, pero devuelve un DataFrame/serie del mismo tamaño que el original y dondequiera que el booleano se evalúe como `True`, se establece en `nan`.
- `.query`: similar a la indexación booleana. Más rápido para DataFrames grandes. Solo admite un conjunto restringido de operaciones; no lo uses si necesitas `isnull()` u otros métodos de DataFrame.
- `.take`: equivalente a `.iloc`, pero puede operar tanto en filas como en columnas.
- `.where`: como la indexación booleana, pero devuelve un DataFrame/serie del mismo tamaño que el original y dondequiera que el booleano se evalúe como `False`, se establece en `nan`.
- [Multi-indexing](http://pandas.pydata.org/pandas-docs/stable/advanced.html): potencialmente útil para conjuntos de datos jerárquicos pequeños a medianos. Lento en conjuntos de datos más grandes.